import React from "react";
import { Col, Container, Row } from "react-bootstrap";
import Image from "next/image";

const ServiceWeOffer = () => {
  return (
    <section className="hero">
      <Container>
        <div className="mainservText">
          <Row>
            <Col md={6}>
              <div className="hero-image text-center border rounded">
                <Image
                  src={"/images/service1.jpeg"}
                  width={360}
                  height={226}
                  alt=" hero image"
                  className="rounded w-100"
                />
              </div>
            </Col>
            <Col md={6}>
              <div className="hero-info">
                <h1>اسم الخدمة</h1>
                <p>
                  لوريم إيبسوم، دولور سيت أميت كونسكتتور أديبيسيسينغ إيليت.
                  موليتيا، كوربوريس دولوريم تيمبورا أديبسي ريبودياندي ريهريبريت
                  آت إلوم لابوريوسام ألياس موليستي؟ أولام ديسيرنت إكس توتام
                  ريكوساند؟ لوريم إيبسوم، دولور سيت أميت كونسكتتور أديبيسيسينغ
                  إيليت. موليتيا، كوربوريس دولوريم تيمبورا أديبسي ريبودياندي
                  ريهريبريت آت إلوم لابوريوسام ألياس موليستي؟ أولام ديسيرنت إكس
                  توتام ريكوساند؟
                </p>
              </div>
            </Col>
          </Row>
          <p>
            لوريم إيبسوم، دولور سيت أميت كونسكتتور أديبيسيسينغ إيليت. موليتيا،
            كوربوريس دولوريم تيمبورا أديبسي ريبودياندي ريهريبريت آت إلوم
            لابوريوسام ألياس موليستي؟ أولام ديسيرنت إكس توتام ريكوساند؟ لوريم
            إيبسوم، دولور سيت أميت كونسكتتور أديبيسيسينغ إيليت. موليتيا،
            كوربوريس دولوريم تيمبورا أديبسي ريبودياندي ريهريبريت آت إلوم
            لابوريوسام ألياس موليستي؟ أولام ديسيرنت إكس توتام ريكوساند؟ لوريم
            إيبسوم، دولور سيت أميت كونسكتتور أديبيسيسينغ إيليت. موليتيا،
            كوربوريس دولوريم تيمبورا أديبسي ريبودياندي ريهريبريت آت إلوم
            لابوريوسام ألياس موليستي؟ أولام ديسيرنت إكس توتام ريكوساند؟
          </p>
          <Row className="reverse">
            <Col md={6}>
              <div className="hero-image text-center border rounded">
                <Image
                  src={"/images/service1.jpeg"}
                  width={360}
                  height={226}
                  alt=" hero image"
                  className="rounded w-100"
                />
              </div>
            </Col>
            <Col md={6}>
              <div className="hero-info">
                <h1>اسم الخدمة</h1>
                <p>
                  لوريم إيبسوم، دولور سيت أميت كونسكتتور أديبيسيسينغ إيليت.
                  موليتيا، كوربوريس دولوريم تيمبورا أديبسي ريبودياندي ريهريبريت
                  آت إلوم لابوريوسام ألياس موليستي؟ أولام ديسيرنت إكس توتام
                  ريكوساند؟ لوريم إيبسوم، دولور سيت أميت كونسكتتور أديبيسيسينغ
                  إيليت. موليتيا، كوربوريس دولوريم تيمبورا أديبسي ريبودياندي
                  ريهريبريت آت إلوم لابوريوسام ألياس موليستي؟ أولام ديسيرنت إكس
                  توتام ريكوساند؟
                </p>
              </div>
            </Col>
          </Row>
          <p>
            لوريم إيبسوم، دولور سيت أميت كونسكتتور أديبيسيسينغ إيليت. موليتيا،
            كوربوريس دولوريم تيمبورا أديبسي ريبودياندي ريهريبريت آت إلوم
            لابوريوسام ألياس موليستي؟ أولام ديسيرنت إكس توتام ريكوساند؟ لوريم
            إيبسوم، دولور سيت أميت كونسكتتور أديبيسيسينغ إيليت. موليتيا،
            كوربوريس دولوريم تيمبورا أديبسي ريبودياندي ريهريبريت آت إلوم
            لابوريوسام ألياس موليستي؟ أولام ديسيرنت إكس توتام ريكوساند؟ لوريم
            إيبسوم، دولور سيت أميت كونسكتتور أديبيسيسينغ إيليت. موليتيا،
            كوربوريس دولوريم تيمبورا أديبسي ريبودياندي ريهريبريت آت إلوم
            لابوريوسام ألياس موليستي؟ أولام ديسيرنت إكس توتام ريكوساند؟
          </p>
        </div>
      </Container>
    </section>
  );
};

export default ServiceWeOffer;
