"use client";
import { Container } from "react-bootstrap";
import Accordion from "react-bootstrap/Accordion";

export default function Asked() {
  return (
    <section className="asked">
      <Container>
        <h2 className="text-center my-5">الأسئلة المتكررة (الكلمات المفتاحية)</h2>
        <Accordion>
          <Accordion.Item eventKey="0">
            <Accordion.Header>البند 1</Accordion.Header>
            <Accordion.Body>
              لوريم إيبسوم دولور سيت أميت، كونسكتتور أديبيسيسينغ إيليت، سيد دو
              إييوسمد تيمبور إنسيديدونت يوت لابوري إت دولوريه ماجنا أليكوا. يوت
              إينيم آد مينيم فينيام، كويز نوسترود إكسرسيتاتيون ألامكو لابوريس
              نيسي يوت أليكويب إكس إيا كومودو كونسيوات. دويس آوت إيرور دولور في
              ريهريبريت إن فيولوبتيه فيليت إيسي سيلوم دولوريو إيو فويغيتا
              نولا باريتور. إكسبتيور سينت أوكياكاي كويبيدات نون بروجيدنت،
              سنت إن كولبا كوي أوفيشيا ديسيرونت موليت أنيم إيد إست لابوروم.
            </Accordion.Body>
          </Accordion.Item>
          <Accordion.Item eventKey="1">
            <Accordion.Header>البند 2</Accordion.Header>
            <Accordion.Body>
              لوريم إيبسوم دولور سيت أميت، كونسكتتور أديبيسيسينغ إيليت، سيد دو
              إييوسمد تيمبور إنسيديدونت يوت لابوري إت دولوريه ماجنا أليكوا. يوت
              إينيم آد مينيم فينيام، كويز نوسترود إكسرسيتاتيون ألامكو لابوريس
              نيسي يوت أليكويب إكس إيا كومودو كونسيوات. دويس آوت إيرور دولور في
              ريهريبريت إن فيولوبتيه فيليت إيسي سيلوم دولوريو إيو فويغيتا
              نولا باريتور. إكسبتيور سينت أوكياكاي كويبيدات نون بروجيدنت،
              سنت إن كولبا كوي أوفيشيا ديسيرونت موليت أنيم إيد إست لابوروم.
            </Accordion.Body>
          </Accordion.Item>
          <Accordion.Item eventKey="2">
            <Accordion.Header>البند 3</Accordion.Header>
            <Accordion.Body>
              لوريم إيبسوم دولور سيت أميت، كونسكتتور أديبيسيسينغ إيليت، سيد دو
              إييوسمد تيمبور إنسيديدونت يوت لابوري إت دولوريه ماجنا أليكوا. يوت
              إينيم آد مينيم فينيام، كويز نوسترود إكسرسيتاتيون ألامكو لابوريس
              نيسي يوت أليكويب إكس إيا كومودو كونسيوات. دويس آوت إيرور دولور في
              ريهريبريت إن فيولوبتيه فيليت إيسي سيلوم دولوريو إيو فويغيتا
              نولا باريتور. إكسبتيور سينت أوكياكاي كويبيدات نون بروجيدنت،
              سنت إن كولبا كوي أوفيشيا ديسيرونت موليت أنيم إيد إست لابوروم.
            </Accordion.Body>
          </Accordion.Item>
          <Accordion.Item eventKey="3">
            <Accordion.Header>البند 4</Accordion.Header>
            <Accordion.Body>
              لوريم إيبسوم دولور سيت أميت، كونسكتتور أديبيسيسينغ إيليت، سيد دو
              إييوسمد تيمبور إنسيديدونت يوت لابوري إت دولوريه ماجنا أليكوا. يوت
              إينيم آد مينيم فينيام، كويز نوسترود إكسرسيتاتيون ألامكو لابوريس
              نيسي يوت أليكويب إكس إيا كومودو كونسيوات. دويس آوت إيرور دولور في
              ريهريبريت إن فيولوبتيه فيليت إيسي سيلوم دولوريو إيو فويغيتا
              نولا باريتور. إكسبتيور سينت أوكياكاي كويبيدات نون بروجيدنت،
              سنت إن كولبا كوي أوفيشيا ديسيرونت موليت أنيم إيد إست لابوروم.
            </Accordion.Body>
          </Accordion.Item>
        </Accordion>
      </Container>
    </section>
  );
}
