import Hero from "@/components/hero/Hero";
import MoreAbout from "@/components/more-about/MoreAbout";
import Testimonials from "@/components/testimonials/Testimonials";
import Map from "@/components/map/Map";
import Asked from "@/components/asked/Asked";
import { Metadata } from "next";
import TextSection from "@/components/text-section/TextSection";
import { Container } from "react-bootstrap";

export const metadata: Metadata = {
  title: "الموقع",
};

export default function Location() {
  return (
    <>
      <Hero />
      <TextSection
        title="نحن نصلح جميع أنواع مشاكل التنظيف"
        subTitle="أفضل جودة"
        paragraph={[
          "لوريم إيبسوم، دولور سيت أميت كونسكتتور أديبيسيسينغ إيليت. موليتيا، كوربوريس دولوريم تيمبورا أديبسي ريبودياندي ريهريبريت آت إلوم لابوريوسام ألياس موليستي؟ أولام ديسيرنت إكس توتام ريكوساند؟ لوريم إيبسوم، دولور سيت أميت كونسكتتور أديبيسيسينغ إيليت. موليتيا، كوربوريس دولوريم تيمبورا أديبسي ريبودياندي ريهريبريت آت إلوم لابوريوسام ألياس موليستي؟ أولام ديسيرنت إكس توتام ريكوساندلوريم إيبسوم، دولور سيت أميت كونسكتتور أديبيسيسينغ إيليت. موليتيا، كوربوريس دولوريم تيمبورا أديبسي ريبودياندي ريهريبريت آت إلوم لابوريوسام ألياس موليستي؟ أولام ديسيرنت إكس توتام ريكوساند",
        ]}
        btnText="(XXX) 123 - 4567"
      />
      <section className="testimonials">
        <Container>
          <Testimonials />
        </Container>
      </section>
      <MoreAbout />

      <TextSection
        title="موقعنا الذي سينظف/يصلح/يحسн أي منزل/مكتب من مشكلة"
        subTitle="أفضل خدمة بأسرع وقت"
        paragraph={[
          "لوريم إيبسوم، دولور سيت أميت كونسكتتور أديبيسيسينغ إيليت. موليتيا، كوربوريس دولوريم تيمبورا أديبسي ريبودياندي ريهريبريت آت إلوم لابوريوسام ألياس موليستي؟ أولام ديسيرنت إكس توتام ريكوساند؟ لوريم إيبسوم، دولور سيت أميت كونسكتتور أديبيسيسينغ إيليت. موليتيا، كوربوريس دولوريم تيمبورا أديبسي ريبودياندي ريهريبريت آت إلوم لابوريوسام ألياس موليستي؟ أولام ديسيرنت إكس توتام ريكوساندلوريم إيبسوم، دولور سيت أميت كونسكتتور أديبيسيسينغ إيليت. موليتيا، كوربوريس دولوريم تيمبورا أديبسي ريبودياندي ريهريبريت آت إلوم لابوريوسام ألياس موليستي؟ أولام ديسيرنت إكس توتام ريكوساند",
          "لوريم إيبسوم، دولور سيت أميت كونسكتتور أديبيسيسينغ إيليت. موليتيا، كوربوريس دولوريم تيمبورا أديبسي ريبودياندي ريهريبريت آت إلوم لابوريوسام ألياس موليستي؟ أولام ديسيرنت إكس توتام ريكوساند؟ لوريم إيبسوم، دولور سيت أميت كونسكتتور أديبيسيسينغ إيليت. موليتيا، كوربوريس دولوريم تيمبورا أديبسي ريبودياندي ريهريبريت آت إلوم لابوريوسام ألياس موليستي؟ أولام ديسيرنت إكس توتام ريكوساندلوريم إيبسوم، دولور سيت أميت كونسكتتور أديبيسيسينغ إيليت. موليتيا، كوربوريس دولوريم تيمبورا أديبسي ريبودياندي ريهريبريت آت إلوم لابوريوسام ألياس موليستي؟ أولام ديسيرنت إكس توتام ريكوساند",
          "لوريم إيبسوم، دولور سيت أميت كونسكتتور أديبيسيسينغ إيليت. موليتيا، كوربوريس دولوريم تيمبورا أديبسي ريبودياندي ريهريبريت آت إلوم لابوريوسام ألياس موليستي؟ أولام ديسيرنت إكس توتام ريكوساند؟ لوريم إيبسوم، دولور سيت أميت كونسكتتور أديبيسيسينغ إيليت. موليتيا، كوربوريس دولوريم تيمبورا أديبسي ريبودياندي ريهريبريت آت إلوم لابوريوسام ألياس موليستي؟ أولام ديسيرنت إكس توتام ريكوساندلوريم إيبسوم، دولور سيت أميت كونسكتتور أديبيسيسينغ إيليت. موليتيا، كوربوريس دولوريم تيمبورا أديبسي ريبودياندي ريهريبريت آت إلوم لابوريوسام ألياس موليستي؟ أولام ديسيرنت إكس توتام ريكوساند",
        ]}
        btnText="(XXX) 123 - 4567"
      />

      <TextSection
        title="الموقع الذي تثق به العملاء في خدماتنا (خدمات التنظيف) منذ سنوات..."
        subTitle="أفضل خدمة بأسرع وقت"
        paragraph={[
          "لوريم إيبسوم، دولور سيت أميت كونسكتتور أديبيسيسينغ إيليت. موليتيا، كوربوريس دولوريم تيمبورا أديبسي ريبودياندي ريهريبريت آت إلوم لابوريوسام ألياس موليستي؟ أولام ديسيرنت إكس توتام ريكوساند؟ لوريم إيبسوم، دولور سيت أميت كونسكتتور أديبيسيسينغ إيليت. موليتيا، كوربوريس دولوريم تيمبورا أديبسي ريبودياندي ريهريبريت آت إلوم لابوريوسام ألياس موليستي؟ أولام ديسيرنت إكس توتام ريكوساندلوريم إيبسوم، دولور سيت أميت كونسكتتور أديبيسيسينغ إيليت. موليتيا، كوربوريس دولوريم تيمبورا أديبسي ريبودياندي ريهريبريت آت إلوم لابوريوسام ألياس موليستي؟ أولام ديسيرنت إكس توتام ريكوساند",
          "لوريم إيبسوم، دولور سيت أميت كونسكتتور أديبيسيسينغ إيليت. موليتيا، كوربوريس دولوريم تيمبورا أديبسي ريبودياندي ريهريبريت آت إلوم لابوريوسام ألياس موليستي؟ أولام ديسيرنت إكس توتام ريكوساند؟ لوريم إيبسوم، دولور سيت أميت كونسكتتور أديبيسيسينغ إيليت. موليتيا، كوربوريس دولوريم تيمبورا أديبسي ريبودياندي ريهريبريت آت إلوم لابوريوسام ألياس موليستي؟ أولام ديسيرنت إكس توتام ريكوساندلوريم إيبسوم، دولور سيت أميت كونسكتتور أديبيسيسينغ إيليت. موليتيا، كوربوريس دولوريم تيمبورا أديبسي ريبودياندي ريهريبريت آت إلوم لابوريوسام ألياس موليستي؟ أولام ديسيرنت إكس توتام ريكوساند",
          "لوريم إيبسوم، دولور سيت أميت كونسكتتور أديبيسيسينغ إيليت. موليتيا، كوربوريس دولوريم تيمبورا أديبسي ريبودياندي ريهريبريت آت إلوم لابوريوسام ألياس موليستي؟ أولام ديسيرنت إكس توتام ريكوساند؟ لوريم إيبسوم، دولور سيت أميت كونسكتتور أديبيسيسينغ إيليت. موليتيا، كوربوريس دولوريم تيمبورا أديبسي ريبودياندي ريهريبريت آت إلوم لابوريوسام ألياس موليستي؟ أولام ديسيرنت إكس توتام ريكوساندلوريم إيبسوم، دولور سيت أميت كونسكتتور أديبيسيسينغ إيليت. موليتيا، كوربوريس دولوريم تيمبورا أديبسي ريبودياندي ريهريبريت آت إلوم لابوريوسام ألياس موليستي؟ أولام ديسيرنت إكس توتام ريكوساند",
        ]}
        btnText="(XXX) 123 - 4567"
      />

      <Map />
      <Asked />
    </>
  );
}
