import { faLinkedin } from "@fortawesome/free-brands-svg-icons";
import { faEnvelope } from "@fortawesome/free-regular-svg-icons";
import { FontAwesomeIcon } from "@fortawesome/react-fontawesome";
import { Col, Container, Row } from "react-bootstrap";

export default function Page() {
  return (
    <section className="blog">
      <div className="blog-header">
        <h1>صفحه البلوج </h1>
      </div>
      <Container>
        <div className="blog-body">
          <h2>خبيرنا (الخدمة) يساعد (الموقع) المقيمين</h2>
          <p>
            لوريم إيبسوم(Lorem Ipsum) هو ببساطة نص شكلي (بمعنى أن الغاية هي
            الشكل وليس المحتوى) ويُستخدم في صناعات المطابع ودور النشر. كان لوريم
            إيبسوم ولايزال المعيار للنص الشكلي منذ القرن الخامس عشر عندما قامت
            مطبعة مجهولة برص مجموعة من الأحرف بشكل عشوائي أخذتها من نص، لتكوّن
            كتيّب بمثابة دليل أو مرجع شكلي لهذه الأحرف. خمسة قرون من الزمن لم
            تقضي على هذا النص، بل انه حتى صار مستخدماً وبشكله الأصلي في الطباعة
            والتنضيد الإلكتروني. انتشر بشكل كبير في ستينيّات هذا القرن مع إصدار
            رقائق "ليتراسيت" (Letraset) البلاستيكية تحوي مقاطع من هذا النص، وعاد
            لينتشر مرة أخرى مؤخراَ مع ظهور برامج النشر الإلكتروني مثل "ألدوس
            بايج مايكر" (Aldus PageMaker) والتي حوت أيضاً على نسخ من نص لوريم
            إيبسوم.
          </p>

          <h2>خبيرنا (الخدمة) يساعد (الموقع) المقيمين</h2>
          <p>
            لوريم إيبسوم(Lorem Ipsum) هو ببساطة نص شكلي (بمعنى أن الغاية هي
            الشكل وليس المحتوى) ويُستخدم في صناعات المطابع ودور النشر. كان لوريم
            إيبسوم ولايزال المعيار للنص الشكلي منذ القرن الخامس عشر عندما قامت
            مطبعة مجهولة برص مجموعة من الأحرف بشكل عشوائي أخذتها من نص، لتكوّن
            كتيّب بمثابة دليل أو مرجع شكلي لهذه الأحرف. خمسة قرون من الزمن لم
            تقضي على هذا النص، بل انه حتى صار مستخدماً وبشكله الأصلي في الطباعة
            والتنضيد الإلكتروني. انتشر بشكل كبير في ستينيّات هذا القرن مع إصدار
            رقائق "ليتراسيت" (Letraset) البلاستيكية تحوي مقاطع من هذا النص، وعاد
            لينتشر مرة أخرى مؤخراَ مع ظهور برامج النشر الإلكتروني مثل "ألدوس
            بايج مايكر" (Aldus PageMaker) والتي حوت أيضاً على نسخ من نص لوريم
            إيبسوم.
          </p>
          <p>
            لوريم إيبسوم(Lorem Ipsum) هو ببساطة نص شكلي (بمعنى أن الغاية هي
            الشكل وليس المحتوى) ويُستخدم في صناعات المطابع ودور النشر. كان لوريم
            إيبسوم ولايزال المعيار للنص الشكلي منذ القرن الخامس عشر عندما قامت
            مطبعة مجهولة برص مجموعة من الأحرف بشكل عشوائي أخذتها من نص، لتكوّن
            كتيّب بمثابة دليل أو مرجع شكلي لهذه الأحرف. خمسة قرون من الزمن لم
            تقضي على هذا النص، بل انه حتى صار مستخدماً وبشكله الأصلي في الطباعة
            والتنضيد الإلكتروني. انتشر بشكل كبير في ستينيّات هذا القرن مع إصدار
            رقائق "ليتراسيت" (Letraset) البلاستيكية تحوي مقاطع من هذا النص، وعاد
            لينتشر مرة أخرى مؤخراَ مع ظهور برامج النشر الإلكتروني مثل "ألدوس
            بايج مايكر" (Aldus PageMaker) والتي حوت أيضاً على نسخ من نص لوريم
            إيبسوم.
          </p>
          <p>
            لوريم إيبسوم(Lorem Ipsum) هو ببساطة نص شكلي (بمعنى أن الغاية هي
            الشكل وليس المحتوى) ويُستخدم في صناعات المطابع ودور النشر. كان لوريم
            إيبسوم ولايزال المعيار للنص الشكلي منذ القرن الخامس عشر عندما قامت
            مطبعة مجهولة برص مجموعة من الأحرف بشكل عشوائي أخذتها من نص، لتكوّن
            كتيّب بمثابة دليل أو مرجع شكلي لهذه الأحرف. خمسة قرون من الزمن لم
            تقضي على هذا النص، بل انه حتى صار مستخدماً وبشكله الأصلي في الطباعة
            والتنضيد الإلكتروني. انتشر بشكل كبير في ستينيّات هذا القرن مع إصدار
            رقائق "ليتراسيت" (Letraset) البلاستيكية تحوي مقاطع من هذا النص، وعاد
            لينتشر مرة أخرى مؤخراَ مع ظهور برامج النشر الإلكتروني مثل "ألدوس
            بايج مايكر" (Aldus PageMaker) والتي حوت أيضاً على نسخ من نص لوريم
            إيبسوم.
          </p>

          <h2>خبيرنا (الخدمة) يساعد (الموقع) المقيمين</h2>
          <p>
            لوريم إيبسوم(Lorem Ipsum) هو ببساطة نص شكلي (بمعنى أن الغاية هي
            الشكل وليس المحتوى) ويُستخدم في صناعات المطابع ودور النشر. كان لوريم
            إيبسوم ولايزال المعيار للنص الشكلي منذ القرن الخامس عشر عندما قامت
            مطبعة مجهولة برص مجموعة من الأحرف بشكل عشوائي أخذتها من نص، لتكوّن
            كتيّب بمثابة دليل أو مرجع شكلي لهذه الأحرف. خمسة قرون من الزمن لم
            تقضي على هذا النص، بل انه حتى صار مستخدماً وبشكله الأصلي في الطباعة
            والتنضيد الإلكتروني. انتشر بشكل كبير في ستينيّات هذا القرن مع إصدار
            رقائق "ليتراسيت" (Letraset) البلاستيكية تحوي مقاطع من هذا النص، وعاد
            لينتشر مرة أخرى مؤخراَ مع ظهور برامج النشر الإلكتروني مثل "ألدوس
            بايج مايكر" (Aldus PageMaker) والتي حوت أيضاً على نسخ من نص لوريم
            إيبسوم.
          </p>
          <p>
            لوريم إيبسوم(Lorem Ipsum) هو ببساطة نص شكلي (بمعنى أن الغاية هي
            الشكل وليس المحتوى) ويُستخدم في صناعات المطابع ودور النشر. كان لوريم
            إيبسوم ولايزال المعيار للنص الشكلي منذ القرن الخامس عشر عندما قامت
            مطبعة مجهولة برص مجموعة من الأحرف بشكل عشوائي أخذتها من نص، لتكوّن
            كتيّب بمثابة دليل أو مرجع شكلي لهذه الأحرف. خمسة قرون من الزمن لم
            تقضي على هذا النص، بل انه حتى صار مستخدماً وبشكله الأصلي في الطباعة
            والتنضيد الإلكتروني. انتشر بشكل كبير في ستينيّات هذا القرن مع إصدار
            رقائق "ليتراسيت" (Letraset) البلاستيكية تحوي مقاطع من هذا النص، وعاد
            لينتشر مرة أخرى مؤخراَ مع ظهور برامج النشر الإلكتروني مثل "ألدوس
            بايج مايكر" (Aldus PageMaker) والتي حوت أيضاً على نسخ من نص لوريم
            إيبسوم.
          </p>
          <p>
            لوريم إيبسوم(Lorem Ipsum) هو ببساطة نص شكلي (بمعنى أن الغاية هي
            الشكل وليس المحتوى) ويُستخدم في صناعات المطابع ودور النشر. كان لوريم
            إيبسوم ولايزال المعيار للنص الشكلي منذ القرن الخامس عشر عندما قامت
            مطبعة مجهولة برص مجموعة من الأحرف بشكل عشوائي أخذتها من نص، لتكوّن
            كتيّب بمثابة دليل أو مرجع شكلي لهذه الأحرف. خمسة قرون من الزمن لم
            تقضي على هذا النص، بل انه حتى صار مستخدماً وبشكله الأصلي في الطباعة
            والتنضيد الإلكتروني. انتشر بشكل كبير في ستينيّات هذا القرن مع إصدار
            رقائق "ليتراسيت" (Letraset) البلاستيكية تحوي مقاطع من هذا النص، وعاد
            لينتشر مرة أخرى مؤخراَ مع ظهور برامج النشر الإلكتروني مثل "ألدوس
            بايج مايكر" (Aldus PageMaker) والتي حوت أيضاً على نسخ من نص لوريم
            إيبسوم.
          </p>
        </div>

        <section className="map">
          <Container>
            <Row>
              <Col md={6}>
                <div className="map-location">
                  <div className="mapouter">
                    <div className="gmap_canvas">
                      <iframe
                        className="gmap_iframe"
                        src="https://maps.google.com/maps?width=600&height=400&hl=en&q=University of Oxford&t=&z=14&ie=UTF8&iwloc=B&output=embed"
                      />
                      <a href="https://sprunkin.com/">Sprunki Incredibox</a>
                    </div>
                    <style
                      dangerouslySetInnerHTML={{
                        __html:
                          ".mapouter{position:relative;text-align:right;width:600px;height:400px;}.gmap_canvas {overflow:hidden;background:none!important;width:600px;height:400px;}.gmap_iframe {width:600px!important;height:400px!important;}",
                      }}
                    />
                  </div>
                </div>
              </Col>
              <Col md={6}>
                <h2>خدمات (الكلمة الرئيسية) في جميع أنحاء منطقة (الموقع)</h2>
                <p>1234 Anywhere PL someCity, XX</p>
                <h6>(123) 456 - 7890</h6>
                <div className="mail">
                  <FontAwesomeIcon
                    icon={faEnvelope}
                    style={{ width: "30px" }}
                  />
                  <span className="me-2">info@thewebsite.com</span>
                </div>

                <ul className="list-unstyled d-flex align-items-center gap-3 text-md-end text-center mt-3">
                  <li>
                    <FontAwesomeIcon
                      icon={faLinkedin}
                      style={{ width: "30px", color: "#0a66c2" }}
                    />
                  </li>
                  <li>
                    <FontAwesomeIcon
                      icon={faLinkedin}
                      style={{ width: "30px", color: "#0a66c2" }}
                    />
                  </li>
                  <li>
                    <FontAwesomeIcon
                      icon={faLinkedin}
                      style={{ width: "30px", color: "#0a66c2" }}
                    />
                  </li>
                </ul>
              </Col>
            </Row>
          </Container>
        </section>
      </Container>
    </section>
  );
}
