
import Image from "next/image";
import Link from "next/link";
import { Col, Container, Row } from "react-bootstrap";

export default function Page() {
  return (
    <section className="service-details py-5">
      <div className="we-offered py-5 ">
        <Container>
          <Row>
            <Col md={6}>
              <h1>(الخدمة المقدمة)</h1>
              <p>
                لوريم إيبسوم، دولور سيت أميت كونسكتتور أديبيسيسينغ إيليت.
                موليتيا، كوربوريس دولوريم تيمبورا أديبسي ريبودياندي ريهريبريت آت
                إلوم لابوريوسام ألياس موليستي؟ أولام ديسيرنت إكس توتام ريكوساند؟
                لوريم إيبسوم، دولور سيت أميت كونسكتتور أديبيسيسينغ إيليت.
                موليتيا، كوربوريس دولوريم تيمبورا أديبسي ريبودياندي ريهريبريت آت
                إلوم لابوريوسام ألياس موليستي؟ أولام ديسيرنت إكس توتام ريكوساند؟
                لوريم إيبسوم، دولور سيت أميت كونسكتتور أديبيسيسينغ إيليت.
                موليتيا، كوربوريس دولوريم تيمبورا أديبسي ريبودياندي ريهريبريت آت
                إلوم لابوريوسام ألياس موليستي؟ أولام ديسيرنت إكس توتام ريكوساند؟
              </p>
            </Col>
            <Col md={6}>
              <Image
                src={"/images/service1.jpeg"}
                width={360}
                height={226}
                alt="service"
                className="rounded w-100"
              />
            </Col>
          </Row>
        </Container>
      </div>
      <div className="our-service py-5">
        <Container>
          <h2>خدمات نقدمها</h2>
          <p>
            لوريم إيبسوم، دولور سيت أميت كونسكتتور أديبيسيسينغ إيليت. موليتيا،
            كوربوريس دولوريم تيمبورا أديبسي ريبودياندي ريهريبريت آت إلوم
            لابوريوسام ألياس موليستي؟ أولام ديسيرنت إكس توتام ريكوساند؟ لوريم
            إيبسوم، دولور سيت أميت كونسكتتور أديبيسيسينغ إيليت. موليتيا،
            كوربوريس دولوريم تيمبورا أديبسي ريبودياندي ريهريبريت آت إلوم
            لابوريوسام ألياس موليستي؟ أولام ديسيرنت إكس توتام ريكوساند؟ لوريم
            إيبسوم، دولور سيت أميت كونسكتتور أديبيسيسينغ إيليت. موليتيا،
            كوربوريس دولوريم تيمبورا أديبسي ريبودياندي ريهريبريت آت إلوم
            لابوريوسام ألياس موليستي؟ أولام ديسيرنت إكس توتام ريكوساند؟ لوريم
            إيبسوم، دولور سيت أميت كونسكتتور أديبيسيسينغ إيليت. موليتيا،
            كوربوريس دولوريم تيمبورا أديبسي ريبودياندي ريهريبريت آت إلوم
            لابوريوسام ألياس موليستي؟ أولام ديسيرنت إكس توتام ريكوساند؟
          </p>
          <div className="service1 py-5">
            <Row>
              <Col md={6}>
                <Image
                  src={"/images/service1.jpeg"}
                  width={360}
                  height={226}
                  alt="service"
                  className="rounded w-100"
                />
              </Col>
              <Col md={6}>
                <h2>اسم الخددمة</h2>
                <p>
                  لوريم إيبسوم، دولور سيت أميت كونسكتتور أديبيسيسينغ إيليت.
                  موليتيا، كوربوريس دولوريم تيمبورا أديبسي ريبودياندي ريهريبريت
                  آت إلوم لابوريوسام ألياس موليستي؟ أولام ديسيرنت إكس توتام
                  ريكوساند؟ لوريم إيبسوم، دولور سيت أميت كونسكتتور أديبيسيسينغ
                  إيليت. موليتيا، كوربوريس دولوريم تيمبورا أديبسي ريبودياندي
                  ريهريبريت آت إلوم لابوريوسام ألياس موليستي؟ أولام ديسيرنت إكس
                  توتام ريكوساند؟ لوريم إيبسوم، دولور سيت أميت كونسكتتور
                  أديبيسيسينغ إيليت. موليتيا، كوربوريس دولوريم تيمبورا أديبسي
                  ريبودياندي ريهريبريت آت إلوم لابوريوسام ألياس موليستي؟ أولام
                  ديسيرنت إكس توتام ريكوساند؟
                </p>
              </Col>
            </Row>
            <p className="service-details py-5">
              لوريم إيبسوم، دولور سيت أميت كونسكتتور أديبيسيسينغ إيليت. موليتيا،
              كوربوريس دولوريم تيمبورا أديبسي ريبودياندي ريهريبريت آت إلوم
              لابوريوسام ألياس موليستي؟ أولام ديسيرنت إكس توتام ريكوساند؟ لوريم
              إيبسوم، دولور سيت أميت كونسكتتور أديبيسيسينغ إيليت. موليتيا،
              كوربوريس دولوريم تيمبورا أديبسي ريبودياندي ريهريبريت آت إلوم
              لابوريوسام ألياس موليستي؟ أولام ديسيرنت إكس توتام ريكوساند؟ لوريم
              إيبسوم، دولور سيت أميت كونسكتتور أديبيسيسينغ إيليت. موليتيا،
              كوربوريس دولوريم تيمبورا أديبسي ريبودياندي ريهريبريت آت إلوم
              لابوريوسام ألياس موليستي؟ أولام ديسيرنت إكس توتام ريكوساند؟
            </p>
          </div>

          <div className="service2 ">
            <Row>
              <Col md={6}>
                <h2>اسم الخددمة</h2>
                <p>
                  لوريم إيبسوم، دولور سيت أميت كونسكتتور أديبيسيسينغ إيليت.
                  موليتيا، كوربوريس دولوريم تيمبورا أديبسي ريبودياندي ريهريبريت
                  آت إلوم لابوريوسام ألياس موليستي؟ أولام ديسيرنت إكس توتام
                  ريكوساند؟ لوريم إيبسوم، دولور سيت أميت كونسكتتور أديبيسيسينغ
                  إيليت. موليتيا، كوربوريس دولوريم تيمبورا أديبسي ريبودياندي
                  ريهريبريت آت إلوم لابوريوسام ألياس موليستي؟ أولام ديسيرنت إكس
                  توتام ريكوساند؟ لوريم إيبسوم، دولور سيت أميت كونسكتتور
                  أديبيسيسينغ إيليت. موليتيا، كوربوريس دولوريم تيمبورا أديبسي
                  ريبودياندي ريهريبريت آت إلوم لابوريوسام ألياس موليستي؟ أولام
                  ديسيرنت إكس توتام ريكوساند؟
                </p>
              </Col>
              <Col md={6}>
                <Image
                  src={"/images/service1.jpeg"}
                  width={360}
                  height={226}
                  alt="service"
                  className="rounded w-100"
                />
              </Col>
            </Row>
            <p className="service-details py-5">
              لوريم إيبسوم، دولور سيت أميت كونسكتتور أديبيسيسينغ إيليت. موليتيا،
              كوربوريس دولوريم تيمبورا أديبسي ريبودياندي ريهريبريت آت إلوم
              لابوريوسام ألياس موليستي؟ أولام ديسيرنت إكس توتام ريكوساند؟ لوريم
              إيبسوم، دولور سيت أميت كونسكتتور أديبيسيسينغ إيليت. موليتيا،
              كوربوريس دولوريم تيمبورا أديبسي ريبودياندي ريهريبريت آت إلوم
              لابوريوسام ألياس موليستي؟ أولام ديسيرنت إكس توتام ريكوساند؟ لوريم
              إيبسوم، دولور سيت أميت كونسكتتور أديبيسيسينغ إيليت. موليتيا،
              كوربوريس دولوريم تيمبورا أديبسي ريبودياندي ريهريبريت آت إلوم
              لابوريوسام ألياس موليستي؟ أولام ديسيرنت إكس توتام ريكوساند؟
            </p>
          </div>
        </Container>
      </div>
      <div className="sub-serve">
        <Container>
          <Row>
            <Col md={6}>
              <ul className="list-unstyled text-center">
                <Link href={"#"}>
                  <li>
                    <Image
                      src={"/images/log.svg"}
                      width={24}
                      height={24}
                      alt="logo"
                      className="ms-2"
                    />
                    اسم الخدمه
                  </li>
                </Link>
                <Link href={"#"}>
                  <li>
                    <Image
                      src={"/images/log.svg"}
                      width={24}
                      height={24}
                      alt="logo"
                      className="ms-2"
                    />
                    اسم الخدمه
                  </li>
                </Link>
                <Link href={"#"}>
                  <li>
                    <Image
                      src={"/images/log.svg"}
                      width={24}
                      height={24}
                      alt="logo"
                      className="ms-2"
                    />
                    اسم الخدمه
                  </li>
                </Link>
                <Link href={"#"}>
                  <li>
                    <Image
                      src={"/images/log.svg"}
                      width={24}
                      height={24}
                      alt="logo"
                      className="ms-2"
                    />
                    اسم الخدمه
                  </li>
                </Link>
                <Link href={"#"}>
                  <li>
                    <Image
                      src={"/images/log.svg"}
                      width={24}
                      height={24}
                      alt="logo"
                      className="ms-2"
                    />
                    اسم الخدمه
                  </li>
                </Link>
              </ul>
            </Col>
            <Col md={6}>
              <ul className="list-unstyled text-center">
                <Link href={"#"}>
                  <li>
                    <Image
                      src={"/images/log.svg"}
                      width={24}
                      height={24}
                      alt="logo"
                      className="ms-2"
                    />
                    اسم الخدمه
                  </li>
                </Link>
                <Link href={"#"}>
                  <li>
                    <Image
                      src={"/images/log.svg"}
                      width={24}
                      height={24}
                      alt="logo"
                      className="ms-2"
                    />
                    اسم الخدمه
                  </li>
                </Link>
                <Link href={"#"}>
                  <li>
                    <Image
                      src={"/images/log.svg"}
                      width={24}
                      height={24}
                      alt="logo"
                      className="ms-2"
                    />
                    اسم الخدمه
                  </li>
                </Link>
                <Link href={"#"}>
                  <li>
                    <Image
                      src={"/images/log.svg"}
                      width={24}
                      height={24}
                      alt="logo"
                      className="ms-2"
                    />
                    اسم الخدمه
                  </li>
                </Link>
                <Link href={"#"}>
                  <li>
                    <Image
                      src={"/images/log.svg"}
                      width={24}
                      height={24}
                      alt="logo"
                      className="ms-2"
                    />
                    اسم الخدمه
                  </li>
                </Link>
              </ul>
            </Col>
          </Row>
        </Container>
      </div>
    </section>
  );
}
